import "./App.css";
import image from "./assets/download.jpeg";
import video from "./assets/sample-video.mp4";
import { useState } from "react";

const App = () => {
  // white = 0, black = 1
  const [theme, setTheme] = useState(0);
  const handleClick = () => {
    if (theme === 0) {
      setTheme(1);
    } else {
      setTheme(0);
    }
  };
  return (
    <div className={`app ${theme === 0 ? "" : "bg_black"}`} id="rootBody">
      <header className="header">
        <div className="search">
          <h4>جست و جو</h4>
          <input type="text" placeholder="جست و جو...." />
        </div>
        <h1 className="title">شهر کاشان</h1>
        <div className="changeBackground">
          <button onClick={handleClick} type="button">
            change Background
          </button>
        </div>
      </header>

      <div className="about">
        <div className="about__sec1">
          <h1 id="1">کاشان</h1>

          <p>
            کاشان شهری تاریخی، مرکز شهرستان کاشان و بزرگترین و پرجمعیت‌ترین
            شهرستان پس از مرکز استان اصفهان میباشد. کاشان را دارالمومنین ، شهر
            گل و گلاب، شهر خانه‌های تاریخی و پایتخت فرش و قالی جهان
            میخوانند.یهودیان کاشان به این شهر لقب اورشلیم کوچک داده بودند ↵این
            شهر زادگاه یکی از کهن‌ترین تمدن‌های جهان در منطقه ای بنام سیلک با
            قدمتی بیش از هفت هزار سال است. کاشان بیست و هشتمین شهر پرجمعیت ایران
            است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با بیش
            از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر ثبت یونسکو (باغ
            فین) شده یکی از دیدنی ترین شهرهای ایران میباشد. کاشان مهد تمدن و
            فرهنگ سنتی ایران است. این شهر دارای بیش از هفت هزار سال قدمت
            شهرنشینی و یکی از زیباترین شهرهای ایران است. کاشان در طول تاریخ
            سکونت گاه مردمانی از نژادها و ادیان مختلف بوده،این شهر در قرون گذشته
            یکی از سکونت گاه های یهویان ایران بود،یهودیان کاشان عمدتاً از دسته
            یهودیان اخراجی از اسپانیا بودند که در این منطقه سکنی گزیدند و در دهه
            های بعدی اکثراً مسلمان شدند کاشان شهری تاریخی، مرکز شهرستان کاشان و
            بزرگترین و پرجمعیت‌ترین شهرستان پس از مرکز استان اصفهان میباشد.
            کاشان را دارالمومنین ، شهر گل و گلاب، شهر خانه‌های تاریخی و پران
            است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با بیش
            از ۱۷۰۰ اثر تاریخی که فت هزار سال است. کاشان بیست و هشتمین شهر
            پرجمعیت ایران است. این شهر اولین تمدن یکجانشینی و شهرنشینی را
            دارد.↵کاشان با بیش از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر
            ثبت یونسکو (باغ فین) شده یکی از دیدنی ترین شهرهای ایران میباشد.
            کاشان مهد تمدن و فرهنگ سنتی ایران است. این شهر دارای بیش از هفت هزار
            سال قدمت شهرنشینی و یکی از زیباترین شهرهای ایران است. کاشان در طول
            تاریخ سکونت گاه مردمانی از نژادها و ادیان مختلف بوده،این شهر در قرون
            گذشته یکی از سکونت گاه های یهویان ایران بود،یهودیان کاشان عمدتاً از
            دسته یهودیان اخراجی از اسپانیا بودند که در این منطقه سکنی گزیدند و
            در دهه های بعدی اکثراً مسلمان شدند
          </p>
        </div>
        <div className="about__sec2">
          <h2>ریشه‌شناسی</h2>
          <p>
            در مورد ریشه نام شهر کاشان مانند بسیاری از نام‌های دیگر اختلاف نظر
            وجود دارد.گفته میشود نام کاشان از قوم کاسی گرفته شده،کاسپین ها گروهی
            از مهاجران بودند که در این منطقه ساکن شدند کاسیان در کاشان امروزی و
            پین ها در منطقه فین کاشان سکونت گزیدند. گروهی کاشان را برگرفته از
            «کی آشیان» به معنای جایگاه حاکمان می‌دانند و گروهی دیگر لغت کاشان را
            به معنی خانه‌های تابستانی که با چوب و نی ساخته می‌شوند، دانسته‌اند.
            بر اساس نظر دیگری کاشان تحریف‌شدهٔ «کاسیان» و به معنای محل اسکان
            اقوام کاسی یا همان کاشی بوده‌است، و امروزه کاشانی‌ها را «کاشی» خطاب
            می‌کنند. در گفته‌های دیگر ساخت کاشی مرغوب در این منطقه را دلیل
            نام‌گذاری شهر به نام کاشیان می‌دانند که به کاشان تحریف شده‌است.[۳]
          </p>
        </div>
        <div className="about__sec3">
          <h3>تاریخچه</h3>
          <h4>دوران پارینه سنگی</h4>
          <p>
            قدیمی‌ترین آثار سکونت انسان در منطقه <strong>کاشان</strong> شامل
            ابزارهای سنگی است که در کنار چشمه‌های نیاسر و در تراورتن کفتار خون
            کشف شده‌اند و مربوط به عصر پارینه سنگی میانی هستند که بیش از چهل
            هزار سال قدمت دارند.[۴] در این دوره احتمالاً انسان نئاندرتال در
            منطقه می‌زیسته‌است. از حدود چهل هزار سال پیش انسان امروزین در منطقه
            مستقر شده که آثار آنها در تپه‌های تراورتن سفید آب یافت شده‌است.[۵]
            انسانهای این دوره از طریق شکار و گردآوری نباتات امرار معاش می‌کردند
            و با توجه به خشکی منطقه بیشتر در اطراف چشمه‌های دامنه کوه کرکس مستقر
            می‌شدند. ابزارهای سنگی ساخته شده توسط این انسانها هم‌اکنون در موزه
            ملی ایران در معرض دید عموم است.
          </p>

          <h5>دوران باستان</h5>
          <h6>نوشتار اصلی :تپه سیلک</h6>
          <p>
            <span>سیَلْک</span> اولین و قدیمی ترین زیگورات جهان است و همچنین
            تنها زیگورات مرکز فلات ایران میباشد که یکی از کهن‌ترین فرهنگ‌های
            یکجانشینی بشر در مرکز فلات ایران است که در شهر کاشان قرار دارد.
            محوطه باستانی سیلک که در منطقه امیرالمؤمنین کاشان واقع شده قدمتی در
            حدود بیش از ۸۰۰۰ تا ۵۰۰۰ سال دارد. نزدیک به ۱۰ هزار سال پیش و در پی
            دگرگونی‌هایی که از لحاظ آب و هوایی در فلات ایران رخ داد، زندگی
            روستانشینی، دامداری و کشاورزی گسترش یافت. آثار کهن‌ترین مردم کشاورز
            و دامدار منطقه در دو مکان سیلک و شورابه در کاشان یافت شده‌است. سیلک
            یکی از مکان‌های تاریخی پس از تمدن جیرفت کرمان در فلات ایران است که
            مدارک نوشته از دوران مادها در آن پیدا شده ولی خطی که هم‌زمان با آغاز
            تاریخ در ایلام به وجود آمده‌بود، با نام پروتو ایلامی شناخته شده پس
            از رها شدن این پایگاه بازرگانی از میان رفت. شهر کاشان در دوره‌ای از
            تاریخ جزئی از سرزمین طبرستان به‌شمار می‌رفته‌است.[۶]
          </p>
        </div>
      </div>
      <div>
        <h3 id="6">دانشگاه‌ها</h3>

        <p>
          کاشان شهری تاریخی، مرکز شهرستان کاشان و بزرگترین و پرجمعیت‌ترین
          شهرستان پس از مرکز استان اصفهان میباشد. کاشان را دارالمومنین ، شهر
          ایران است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با
          بیش از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر ثبت یونسکو (باغ
          فین) شده یکی از دیدنی ترین شهرهای ایران میباشد. شهرستان کاشان و
          بزرگترین و پرجمعیت‌ترین شهرستان پس از مرکز استان اصفهان میباشد. کاشان
          را دارالمومنین ، شهر گل و گلاب، شهر خانه‌های تاریخی و پایتخت فرش و
          قالی جهان میخوانند.یهودیان کاشان به این شهر لقب اورشلیم کوچک داده
          بودند ↵این شهر زادگاه یکی از کهن‌ترین \ عمدتاً از دسته یهودیان اخراجی
          از اسپانیا بودند که در این منطقه سکنی گزیدند و در دهه های بعدی اکثراً
          مسلمان شدند
        </p>
      </div>
      <div className="list">
        <h2>لیست </h2>
        <ul>
          <li>
            <a href="#1">کاشان</a>
          </li>
          <li>
            <a href="#2">مکان‌نگاری</a>
          </li>
          <li>
            <a href="#3">زمین شناسی</a>
          </li>
          <li>
            <a href="#4">مناطق مدیریت</a>
          </li>
          <li>
            <a href="#5">مطبوعات</a>
          </li>
          <li>
            <a href="#6">دانشگاه‌ها</a>
          </li>
        </ul>
      </div>

      <div className="img">
        <img src={image} alt="img" style={{ width: "100%" }} />
      </div>

      <div className="TABLE">
        <h1 style={{ textAlign: "center" }}>کاشان</h1>
        <table border="5" cellSpacing="0" align="center">
          <thead>
            <tr>
              <th align="center" height="50" width="100">
                زمان بازدید
              </th>
              <th align="center" height="50" width="100">
                9:30-10:20
              </th>
              <th align="center" height="50" width="100">
                10:20-11:10
              </th>
              <th align="center" height="50" width="100">
                11:10-12:00
              </th>
              <th align="center" height="50" width="100">
                12:00-12:40
              </th>
              <th align="center" height="50" width="100">
                12:40-1:30
              </th>
              <th align="center" height="50" width="100">
                1:30-2:20
              </th>
              <th align="center" height="50" width="100">
                2:20-3:10
              </th>
              <th align="center" height="50" width="100">
                3:10-4:00
              </th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td align="center" height="50">
                دوشنبه
              </td>
              <td align="center" height="50">
                سیلیک
              </td>
              <td align="center" height="50">
                قهرود
              </td>
              <td align="center" height="50">
                قمصر
              </td>

              <td colSpan="3" align="center" height="50">
                محتشم کاشانی
              </td>
              <td align="center" height="50">
                جوشقون
              </td>
              <td align="center" height="50">
                ماکو
              </td>
            </tr>
            <tr>
              <td align="center" height="50">
                سه شنبه
              </td>
              <td colSpan="3" align="center" height="50">
                فین کاشان
              </td>
              <td align="center" height="50">
                قمصر
              </td>
              <td align="center" height="50">
                جزاوند
              </td>
              <td align="center" height="50">
                بازار
              </td>
              <td align="center" height="50">
                سیلیک
              </td>
              <td align="center" height="50">
                ناهار
              </td>
            </tr>
          </tbody>
        </table>
      </div>

      <div className="info">
        <div>
          <h3 id="2">مکان‌نگاری</h3>

          <p>
            کاشان شهری تاریخی، مرکز شهرستان کاشان و بزرگترین و پرجمعیت‌ترین
            شهرستان پس از مرکز استان اصفهان میباشد. کاشان را دارالمومنین ، شهر
            ایران است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با
            بیش از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر ثبت یونسکو
            (باغ فین) شده یکی از دیدنی ترین شهرهای ایران میباشد.
          </p>
        </div>

        <div>
          <h3 id="3">زمین شناسی</h3>

          <p>
            کاشان شهری تاریخی، مرکز شهرستان کاشان و بزرگترین و پرجمعیت‌ترین
            شهرستان پس از مرکز استان اصفهان میباشد. کاشان را دارالمومنین ، شهر
            ایران است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با
            بیش از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر ثبت یونسکو
            (باغ فین) شده یکی از دیدنی ترین شهرهای ایران میباشد.
          </p>
        </div>
        <div>
          <h3 id="4">مناطق مدیریت</h3>

          <p>
            کاشان شهری تاریخی، مرکز شهرستان کاشان و بزرگترین و پرجمعیت‌ترین
            شهرستان پس از مرکز استان اصفهان میباشد. کاشان را دارالمومنین ، شهر
            ایران است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با
            بیش از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر ثبت یونسکو
            (باغ فین) شده یکی از دیدنی ترین شهرهای ایران میباشد.
          </p>
        </div>
        <div>
          <h3 id="5">مطبوعات</h3>

          <p>
            کاشان شهری تاریخی، مرکز شهرستان کاشان و بزرگترین و پرجمعیت‌ترین
            شهرستان پس از مرکز استان اصفهان میباشد. کاشان را دارالمومنین ، شهر
            ایران است. این شهر اولین تمدن یکجانشینی و شهرنشینی را دارد.↵کاشان با
            بیش از ۱۷۰۰ اثر تاریخی که 333 اثر آن ثبت ملی و یک اثر ثبت یونسکو
            (باغ فین) شده یکی از دیدنی ترین شهرهای ایران میباشد.
          </p>
        </div>
      </div>

      <div className="video">
        <h1>فیلم با طول 150px</h1>
        <video width="150" controls>
          <source src={video} type="video/mp4" />
        </video>
      </div>

      <footer>
        <h3 className="footer_title">Font Awesome 4 Icons</h3>
        <div className="icons">
          <i className="fa fa-cloud"></i>
          <i className="fa fa-heart"></i>
          <i className="fa fa-car"></i>
          <i className="fa fa-file"></i>
          <i className="fa fa-bars"></i>
        </div>
      </footer>
    </div>
  );
};

export default App;
